---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBackDirn2
source: html/7bf33151-6ca1-3d2a-14f0-9f6d02a19b0b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBackDirn2 Property

"Interior Minor Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookOrientBackDirn2 { get; }
```